{"pageProps":{"post":{"title":"Physical reservoir computing with FORCE learning in a living neuronal culture","excerpt":"An experimental setup for PRC of a living neuronal culture.","featuredImage":{"url":"https://media.graphcms.com/cWn9fgMOQ32en3oW7A54"},"author":{"name":"Kerem Bayraktar","bio":"Computer scientist currently student at TU Delft.","photo":{"url":"https://media.graphcms.com/IOTagUWRP6ti05SqT0fK"}},"createdAt":"2022-03-17T10:12:27.461575+00:00","slug":"physical-reservoir","content":{"raw":{"children":[{"type":"paragraph","children":[{"text":""},{"href":"https://images.squarespace-cdn.com/content/v1/5ef63c9ed5738e5562697e28/3a1b3e83-08c1-4cee-8c76-62385cd6ae61/5.0064771.figures.online.highlight_f1.jpg?format=750w","type":"link","title":"(Image)","children":[{"text":"https://images.squarespace-cdn.com/content/v1/5ef63c9ed5738e5562697e28/3a1b3e83-08c1-4cee-8c76-62385cd6ae61/5.0064771.figures.online.highlight_f1.jpg?format=750w"}],"openInNewTab":true},{"text":""}]},{"type":"paragraph","children":[{"text":"Rich dynamics in a living neuronal system can be considered as a computational resource for physical reservoir computing (PRC). However, PRC that generates a coherent signal output from a spontaneously active neuronal system is still challenging. \n\nTo overcome this difficulty, we here constructed a closed-loop experimental setup for PRC of a living neuronal culture, where neural activities were recorded with a microelectrode array and stimulated optically using caged compounds. The system was equipped with first-order reduced and controlled error learning to generate a coherent signal output from a living neuronal culture. \n\nOur embodiment experiments with a vehicle robot demonstrated that the coherent output served as a homeostasis-like property of the embodied system from which a maze-solving ability could be generated. Such a homeostatic property generated from the internal feedback loop in a system can play an important role in task solving in biological systems and enable the use of computational resources without any additional learning."}]},{"type":"paragraph","children":[{"text":""},{"href":"https://aip.scitation.org/doi/10.1063/5.0064771","type":"link","children":[{"text":"Read more"}],"openInNewTab":false},{"text":"!"}]}]}},"categories":[{"name":"News","slug":"news"}]}},"__N_SSG":true}