{"pageProps":{"post":{"title":"Nokia deploys AI video analytics to improve rail crossing safety","excerpt":"Nokia’s latest efforts to use AI for real-time data processing can prove to be very beneficial for rail cross safety.","featuredImage":{"url":"https://media.graphcms.com/ktm6jfOgSxyAZZpzVBRU"},"author":{"name":"Kerem Bayraktar","bio":"Computer scientist currently student at TU Delft.","photo":{"url":"https://media.graphcms.com/IOTagUWRP6ti05SqT0fK"}},"createdAt":"2022-03-17T10:07:34.385839+00:00","slug":"nokia","content":{"raw":{"children":[{"type":"paragraph","children":[{"text":"Nokia has announced the new deployment of its AI video analytics product “Scene Analytics” in cooperation with the Swiss-based public transport company Baselland Transport AG(BLT) in order to increase security along side the railway especially on its rail crossings. The main goal of Scene Analytics is to improve situational awareness by efficiently using streams of data such as CCTVs or microphones and create reactive solutions in combination with IoT(Internet of Things). Considering that over 99% of collected video, audio and sensor records are about “regular“ "},{"href":"https://onestore.nokia.com/asset/206604","type":"link","children":[{"text":"behavior"}],"openInNewTab":false},{"text":", the use of AI proves to be very beneficial as it can decrease the real-time process and reaction time. By classifying which situations can be specified as “usual” and which are “unusual”, AI-based algorithms can significantly improve the automation process for live data. This is particularly helpful in cases such as rail crossing safety, as the trains need to know ahead of time whether it’s safe to continue or start braking in order to prevent any accidents. Scene Analytics will alert the responsible personnel in cases where it decides that further action is needed and help to drastically reduce the time needed to go through data that is streamed 24/7. Nokia is aiming to also reduce the cost of resources as most of the mechanism will be automatized in a way. The use of machine learning also helps to tailor the solution according to the needs of the present problem. A previous example use of Scene Analytics for determining the noise-level at a street can be seen below. This level of flexibility makes AI very important for IoT solutions and problems that we face across our everyday lives."}]},{"type":"paragraph","children":[{"text":""},{"href":"https://images.squarespace-cdn.com/content/v1/5ef63c9ed5738e5562697e28/77c21b16-ff21-413d-a469-e055f2683727/nokia_analytics.jpg?format=1500w","type":"link","title":"(Image)","children":[{"text":"https://images.squarespace-cdn.com/content/v1/5ef63c9ed5738e5562697e28/77c21b16-ff21-413d-a469-e055f2683727/nokia_analytics.jpg?format=1500w"}],"openInNewTab":true},{"text":""}]},{"type":"paragraph","children":[{"text":"An example of an earlier implementation of Nokia Scene Analytics in an effort to quantify the vehicle-based noise pollution in the city of Genk, Belgium. ","italic":true},{"href":"https://www.nokia.com/about-us/news/releases/2021/12/15/nokia-deploys-ai-powered-smart-city-trial-to-address-vehicle-based-noise-pollution-in-the-city-of-genk-belgium/","type":"link","children":[{"text":"Source","italic":true}],"openInNewTab":false},{"text":""}]}]}},"categories":[{"name":"News","slug":"news"}]}},"__N_SSG":true}